Keyrim/drone-stm32f1/ground_station/lib/bsp/stm32f1_sd.c
					if (res == FR_OK)
					{
						debug_printf("FAT type = %u (%s)\nBytes/Cluster = %lu\nNumber of FATs = %u\n"
									"Root DIR entries = %u\nSectors/FAT = %lu\nNumber of clusters = %lu\n"
									"FAT start (lba) = %lu\nDIR start (lba,clustor) = %lu\nData start (lba) = %lu\n\n",
									(WORD)fs->fs_type,
									(fs->fs_type==FS_FAT12) ? "FAT12" : (fs->fs_type==FS_FAT16) ? "FAT16" : "FAT32",
									(DWORD)fs->csize * 512, (WORD)fs->n_fats,
									fs->n_rootdir, fs->fsize, (DWORD)fs->n_fatent - 2,
									fs->fatbase, fs->dirbase, fs->database
						);
						display("SD Card : mounted\n");
						state = WRITE_TEST_FILE;
					}
				}
				if(res != FR_OK)
					verbose_fresult(res);
			}
			break;}
		case WRITE_TEST_FILE:{
			UINT nb_to_write;
			UINT nb_written;

			res = f_open(&file, path, FA_WRITE | FA_CREATE_ALWAYS | FA_OPEN_ALWAYS);
			if(res == FR_OK)
			{
				debug_printf("File %s opened\n",path);
				display("Testfile opened\n");
				nb_to_write = strlen((char *)datas_to_write);
				res = f_write(&file,datas_to_write,nb_to_write,&nb_written);
				if(res == FR_OK && nb_to_write == nb_written)
					debug_printf("datas wrote in file\n");
				else
					debug_printf("Fail to write datas in file\n");
				f_close(&file);
			}
			else
			{
				debug_printf("Fail to open file %s\n",path);
			}

			state = READ_TEST_FILE;
			break;}
		case READ_TEST_FILE:{
			#define READ_BUFFER_SIZE	32
			UINT nb_read = 0;
			uint8_t datas_read[READ_BUFFER_SIZE];
			res = f_open(&file, path, FA_READ);
			if(res == FR_OK)
			{
				res = f_read(&file,datas_read,READ_BUFFER_SIZE,&nb_read);
				datas_read[nb_read] = '\0';	//Pour utiliser strcmp...
				if(strcmp((char*)datas_read,(char*)datas_to_write) == 0)
					debug_printf("Correct data read\n");
				else
					debug_printf("Bad data read : %d datas : %s\n",nb_read,datas_read);
				f_close(&file);
			}
			state = DELETE_TEST_FILE;
			break;}
		case DELETE_TEST_FILE:
			res = f_unlink(path);
			if(res == FR_OK)
				debug_printf("Test File deleted : ok\n");
			else
				debug_printf("Error deleting test file\n");
			state = IDLE;
			break;

		case END_WITH_ERROR:
			debug_printf("SD Card : error\n");
			display("SD Card : ERROR\n");
			state = IDLE;
			break;
		case IDLE:
			if(ask_for_finish)
			{
				state = INIT;
				ret = END_OK;
			}
			break;
		default:
			break;
	}

	if(res != FR_OK)
		verbose_fresult(res);
	return ret;
}
#endif
/**
  * @}
  */  

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
